{"pageProps":{"post":{"title":"viação cometa","date":"2020-09-07T05:35:07.322Z","slug":"002-viacao-cometa","author":{"name":"denis lee"},"content":"<p>Devido ao Covid-19 e a política de quarentena para amenizar as mortes e a queda do sistema de saúde pública aqui no Brasil, muitos comércios fecharam seu funcionamento. Porém, depois de um tempo, tivemos um afrouxamento da quarentena e a algumas empresas começaram a voltar a funcionar. Porém, aos poucos e com cuidado.</p>\n<p>Uma das categorias de negócios mais afetada foi o transporte. Com a quarentena, não tem muito sentido as pessoas utilizarem transporte no geral, não sendo essencial. Por esse motivo, viagens foram canceladas e futuras passagens impedidas de serem compradas.</p>\n<p>Antes da pandemia aparecer em nossa dimensão, eu estava me encontrando com uma pessoa e, depois de tanto esperar (pacientemente), pude ver que as passagens começaram a serem vendidas novamente. Porém, reparei na minha repetição de entrar no site para verificar a disponibilidade de passagens. E vi a oportunidade de poder automatizar isso. Com isso em mente, surgiu a idéia de criar uma aplicação que faz essa verificação para mim.</p>\n<h2>O Plano</h2>\n<p>O fluxo seria o seguinte:</p>\n<ul>\n<li>verificação de passagens no site</li>\n<li>alertar os horários pelo whatsapp</li>\n</ul>\n<p>Dois passos.</p>\n<h2>O site</h2>\n<p>Imaginei que precisaria fazer o tratamento do HTML do site. Porém, para a minha alegria, isso não seria necessário, uma vez que existe um endpoint que o front consulta, deixando tudo bem mais fácil.</p>\n<p>Logo abaixo dá para ver que um simples GET já é possível receber o JSON com as cidades que a empresa trabalha.</p>\n<pre><code class=\"language-sh\">$ http https://www.viacaocometa.com.br/content/jca/cometa/pt-br/jcr:content.getDestinos.json?origem=467\nHTTP/1.1 200 OK\nX-Vhost: www.viacaocometa.com.br\n\n{\n    \"listaLocalidade\": {\n        \"erro\": {\n            \"descricaoAlerta\": \"\",\n            \"descricaoErro\": \"\",\n            \"ocorreuAlerta\": false,\n            \"ocorreuErro\": false,\n            \"sessionValid\": true\n        },\n        \"lsLocalidade\": [\n            {\n                \"cidade\": \"A PRATA\",\n                \"id\": 443,\n                \"uf\": \"SP\"\n            },\n            {\n                \"cidade\": \"AMERICANA\",\n                \"id\": 64,\n                \"uf\": \"SP\"\n            },\n            ...\n             {\n                \"cidade\": \"ÁGUAS DA PRATA\",\n                \"id\": 14,\n                \"uf\": \"SP\"\n            }\n        ]\n    }\n}\n</code></pre>\n<p>E então, depois de facilitar muito o meu trabalho retornando um JSON, foi simplesmente configurar como enviar uma mensagem pelo Whatsapp.</p>\n<h2>Whatsapp</h2>\n<p>Para isso, uma galera fez um excelente trabalho de simular todo o Whatsapp Web, deixando só o esforço de chamar uma função para enviar uma mensagem (enviar uma mensagem seria única ação que eu precisaria, uma vez que eu não estou fazendo um bot de conversa).</p>\n<p>Precisei autorizar o uso do meu número (utilizando o QR Code). Após isso, foi só configurar o destinatário e pronto. Nesse caso, eu fiz para mandar mensagem para mim mesmo.</p>\n<p>https://github.com/Rhymen/go-whatsapp</p>\n<p><img src=\"post-004-msg.webp\" alt=\"mensagem no whatsapp\"></p>\n<p><em>(Como a mensagem fica no WhatsApp)</em></p>\n<h2>CronJob</h2>\n<p>Para fazer a verificação de tempos em tempos pensei em diversas estratégias.</p>\n<p>A primeira estratégia foi em utilizar o:</p>\n<p>https://github.com/robfig/cron</p>\n<p>Porém, para deixar a aplicação cuidar disso, eu precisaria que ele precisasse ficar rodando indefinitivamente. Com o risco da aplicação morrer ou qualquer outra instabilidade acontecer, preferi passar a responsabilidade para o sistema operacional. Nesse caso, o Linux.</p>\n<p>Como o Linux não possui muitos problemas em executar os binários gerados pelo Go, então isso não seria um problema também.</p>\n<h2>Github</h2>\n<p>Para quem tiver curiosidade em verificar o código da aplicação simples que eu fiz, segue o link:</p>\n<p>https://github.com/denislee/viacaocometa-alert</p>\n"}},"__N_SSG":true}