{"pageProps":{"post":{"title":"sway","date":"2020-02-22T05:35:07.322Z","slug":"005-sway","author":{"name":"denis lee"},"content":"<h1>Motivação</h1>\n<p>Uma das poucas coisas que me fariam mudar de ideia de trocar de sistema operacional, window manager ou qualquer software que eu uso no computador, com certeza, é velocidade/performance (por isso que, normalmente, não gosto de aplicações feitas em Electron, pois costumam ser bem devagar).</p>\n<p>E, visto que o Sway é a transição mais tranquila para usuários i3, porém com um twist bem importante para a performance, pois utiliza o wayland no lugar do xorg.</p>\n<h1>Dificuldades</h1>\n<p>Mas, nem tudo são flores. Apesar de eu ser super baunilha (sempre usei o Manjaro com i3 do jeito que veio), existem alguns programas bem específicos que eu uso no meu dia a dia. Eles são:</p>\n<ul>\n<li>Synergy (sério, tenho múltiplos computadores ligados na mesa.)</li>\n<li>Flameshot</li>\n<li>xmodmap</li>\n</ul>\n<p>O resto, eu realmente não liguei muito e minha configuração antiga do i3 serviu muito bem no Sway. Mas, nesses programas eu tive um bom atrito (um deles eu ainda não encontrei substituto).</p>\n<h1>Flameshot</h1>\n<p>O problema foi resolvido com a sugestão de um colega meu do trabalho, com o combo de aplicações: grim, slurp e swappy. Que, honestamente, funciona melhor que o Flameshot no aspecto de edição da imagem antes de exportar.</p>\n<pre><code>    bindsym $mod+p exec grim -g \"$(slurp)\" - | swappy -f -\n</code></pre>\n<h1>xmodmap</h1>\n<p>No meu computador de trabalho eu não tive dificuldades, pois eu utilizei um teclado mecânico completamente configurável. E, com isso, consegui deixar as teclas do jeito que eu queria:</p>\n<ul>\n<li>Troca do Capslock por Ctrl</li>\n<li>Troca das teclas vizinhas do espaço pelos Supers (Mod4)</li>\n</ul>\n<p>Já no meu laptop pessoal, eu tenho um computador que comprei no Japão. E, por esse motivo, ele tem um teclado diferente. Possui teclas adicionais:</p>\n<ul>\n<li>Muhenkan (No conversion)</li>\n<li>Henkan (Convert)</li>\n<li>Kana Mode</li>\n</ul>\n<p>Eu aproveito essas teclas para transformar no Super (Mod4), que são teclas muito importante para gerenciamento de janelas em windows managers de tiling (colocação?). E, como eu usava um arquivo .Xmodmap para configurar essas teclas e o wayland não aceita mais essas teclas, eu tive que criar o seguinte arquivo <code>~/.xkb/symbols/jp-mod</code></p>\n<pre><code>partial modifier_keys\nxkb_symbols \"basic\" {\n  include \"us(intl)\"\n  key &#x3C;MUHE> { [ Super_L ] };\n  key &#x3C;HENK> { [ Super_R ] };\n  modifier_map Mod4 { &#x3C;MUHE>, &#x3C;HENK> };\n};\n</code></pre>\n<p>E faço referência no arquivo de configuração do Sway <code>~/.config/sway/config</code></p>\n<pre><code>input * {\n  xkb_layout jp-mod\n  xkb_options caps:ctrl_modifier\n}\n</code></pre>\n<h1>Synergy</h1>\n<p>Infelizmente não existe substituto que funcione como o Synergy ou próximo disso. E, fazer ele funcionar no wayland é um esforço bem grande.</p>\n<p>Se você realizar uma busca na internet vai encontrar uma discussão sobre a compatibilidade do Synergy para o wayland de 2014. Sim, 2014:</p>\n<ul>\n<li>https://github.com/symless/synergy-core/issues/4090</li>\n</ul>\n<p>E, toda issue aberta sobre isso, é automaticamente fechada e o CEO da empresa garante que isso está no roadmap para a próxima grande release deles:</p>\n<ul>\n<li>https://symless.com/synergy/roadmap</li>\n</ul>\n<p>Algo que está sendo prometido desde 2014 e deu em feijoada até agora. Duvido muito que vamos ver algo dessa portabilidade em um futuro próximo.</p>\n<p>Pesquisando alternativas encontrei algo que faz um KVM bem meia boca de maneira virtual que não depende do xorg ou do wayland para funcionar:</p>\n<ul>\n<li>https://github.com/htrefil/rkvm</li>\n</ul>\n<p>Porém, diversas pessoas reportaram que não funciona. E, de fato, não funcionou para mim também. A única coisa que acontece, é travar o seu computador assim que sobe o server. Alguém, aparentemente, conseguiu mapear o problema, mas sem sucesso de fazer funcionar.</p>\n<h1>Conclusão</h1>\n<p>Estou gostando bastante do Sway, mesmo não conseguindo utilizar 100% todas as aplicações que eu tinha acesso antigamente. Mas, mesmo assim, ainda acho que vale a pena a troca da falta do Synergy para a performance que ele prove.</p>\n<p>Para quem tiver curiosidade:</p>\n<ul>\n<li>https://swaywm.org/</li>\n</ul>\n"}},"__N_SSG":true}